<center><h1>Jupyter Magic With SQL</h1></center>

#### Prerequisites
+ Python 3.x (installed)
+ MySQL workbench (installed)
+ mysql connectors (mysql-connector-python, pymysql, SQLalchemy)
+ ipython-sql for magic command
+ I am a MacOS user

 
+ https://holypython.com/python-sqlite-tutorial/python-magic-for-sql/
+ https://holypython.com/python-sqlite-tutorial/querying-a-database-with-python-sqlite/

In [1]:
# # install ipython-sql
# !pip install ipython-sql

## install mysql connectors

# # pymysql
# !pip install pymysql

# # mysql-connector-python
# !pip install mysql-connector-python

# # SQLalchemy
# !pip install sqlalchemy

# !pip install mysql.connector # this package doesn't work for me. Stackoverflow says this package is outdated

In [2]:
# Check all the magic commands
%lsmagic

> The ipython-sql library is loaded using the **%load_ext** iPython extension syntax and is pointed to the connection object as follows:

In [3]:
# load 
%load_ext sql

> IPython SQL magic extension makes it possible to write SQL queries directly into code cells as well as read the results straight into pandas DataFrames (Source).

#### Connect the database with SQLAlchemy and pymysql

In [4]:
import sqlalchemy

db_url = "mysql+pymysql://{user}:{pw}@localhost/{db}".format(user="root", pw="Skior.638", db="pythonDB")

# # create the engine to work with .csv, pandas dataframe and MySQL database
# engine = sqlalchemy.create_engine(db_url)

> To connect to the database we need to pass connection url in SQLAlchemy format to the %sql function.

In [5]:
# Use curled braces
%sql {db_url}

### SQL Cell Magic
>Cell magic applies to the whole cell. Type **%%sql** and the rest of the cell will be treated as an sql script.

In [6]:
%%sql 

SHOW DATABASES;

 * mysql+pymysql://root:***@localhost/pythonDB
7 rows affected.

[('Coursera',),
 ('IBM',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('pythonDB',),
 ('sys',)]

In [7]:
%%sql

SHOW TABLES;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

[('INSTRUCTOR',), ('NEW_STUDENT',), ('STUDENT',)]

### SQL Line Magic
>Line magic applies to the entire line. Type **%sql** and the rest of the line will be treated as an sql script.

In [8]:
%sql SELECT *  FROM INSTRUCTOR LIMIT 5

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

[(1, 'Rav', 'Ahuja', 'KOLKATA', 'CA'),
 (2, 'Raul', 'Chong', 'Markham', 'CA'),
 (3, 'Hima', 'Vasudevan', 'Chicago', 'US')]

In [9]:
%%sql

UPDATE INSTRUCTOR SET LNAME= 'Mondal', CCODE = 'KO' WHERE id = 1;

 * mysql+pymysql://root:***@localhost/pythonDB
1 rows affected.

[]

In [10]:
%%sql 

SELECT * FROM INSTRUCTOR;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

[(1, 'Rav', 'Mondal', 'KOLKATA', 'KO'),
 (2, 'Raul', 'Chong', 'Markham', 'CA'),
 (3, 'Hima', 'Vasudevan', 'Chicago', 'US')]

In [11]:
# %sql DROP TABLE NEW_STUDENT;

<center><h1> Saving SQL Result as CSV File</h1></center>

> We can save the results of our query to an csv file with simply using **.csv()** method.

In [12]:
%%sql 

result << SELECT * FROM INSTRUCTOR;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.
Returning data to local variable result

In [13]:
#or
result = %sql SELECT * FROM INSTRUCTOR;

 * mysql+pymysql://root:***@localhost/pythonDB
3 rows affected.

In [14]:
# Check your current directory
# !pwd

path = "/Users/skior/Documents/Study Materials/SQL"

result.csv(path + 'New_Instructor.csv')

CSV results at /Users/skior/Documents/Study Materials/SQLNew_Instructor.csv

<center><h1>Convert to Pandas DataFrame</h1></center>

> We can save the results of our query to a Pandas DataFrame using **.DataFrame()** method.

In [15]:
import pandas as pd
df = result.DataFrame()
df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav     Mondal  KOLKATA    KO
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      int64
 1   FNAME   3 non-null      object
 2   LNAME   3 non-null      object
 3   CITY    3 non-null      object
 4   CCODE   3 non-null      object
dtypes: int64(1), object(4)
memory usage: 248.0+ bytes

In [17]:
#Listing Database Connections

listing = %sql l / --connections

listing

{'mysql+pymysql://root:***@localhost/pythonDB': <sql.connection.Connection at 0x7fa70a8c36a0>}

In [18]:
# # Closing Database Connections
# %sql -x / --close "connection name"